In [ ]:
# FILTERING DATA USING DIFFERENT CLAUSES

#1. WHERE CLAUSE AND DIFFERENT USE CASES OF WHERE CLAUSE ONE BY ONE..

In [ ]:
# pip package..module..connection variable..cursor

In [1]:
pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\admin\anaconda3\lib\site-packages (8.3.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import mysql.connector as d
from tabulate import tabulate
mydb = d.connect(host = 'localhost',user = 'root',passwd = 'Loveumom@123')
cursor = mydb.cursor()

In [3]:
cursor.execute("SHOW DATABASES")    # TO SEE AVAILABLE DATABASES
results = cursor.fetchall()
#columns = [column[0] for column in cursor.description]
print(tabulate(results,headers = ['DATABASES'],tablefmt = 'pretty'))

+--------------------+
|     DATABASES      |
+--------------------+
|     cardataset     |
| information_schema |
|       mysql        |
| performance_schema |
|      sidfirst      |
|    sqlpractice1    |
|        sys         |
+--------------------+

In [4]:
cursor.execute('USE sidfirst')     # TO SEE AVAILABLE TABLES IN PERTICULAR DATABASE
cursor.execute('SHOW TABLES')
results = cursor.fetchall()
#columns = [column[0] for column in cursor.description]
print(tabulate(results,headers = ['Tables in sidfirst'] ,tablefmt = 'pretty'))

+--------------------+
| Tables in sidfirst |
+--------------------+
|     glassdata      |
|      ineuron       |
|      mysales       |
|       sales        |
|        sid1        |
|      workers       |
+--------------------+

In [16]:
cursor.execute("CREATE TABLE sidfirst.mysales (sale_id INT,product_id INT,product_name VARCHAR(255),customer_id INT,customer_name VARCHAR(255),sale_date DATE,quantity INT,price DECIMAL(10, 2),total_amount DECIMAL(10, 2));")

In [19]:
cursor.execute("""
INSERT INTO sidfirst.mysales VALUES
(1, 101, 'Laptop', 201, 'Alice', '2023-01-15', 1, 1200.00, 1200.00),
(2, 102, 'Smartphone', 202, 'Bob', '2023-01-16', 2, 800.00, 1600.00),
(3, 103, 'Tablet', 203, 'Charlie', '2023-01-17', 1, 500.00, 500.00),
(4, 101, 'Laptop', 204, 'David', '2023-01-18', 1, 1200.00, 1200.00),
(5, 104, 'Headphones', 205, 'Eve', '2023-01-19', 3, 150.00, 450.00),
(6, 105, 'Monitor', 206, 'Frank', '2023-01-20', 2, 300.00, 600.00),
(7, 102, 'Smartphone', 207, 'Grace', '2023-01-21', 1, 800.00, 800.00),
(8, 106, 'Keyboard', 208, 'Heidi', '2023-01-22', 4, 100.00, 400.00),
(9, 107, 'Mouse', 209, 'Ivan', '2023-01-23', 2, 50.00, 100.00),
(10, 108, 'Printer', 210, 'Judy', '2023-01-24', 1, 200.00, 200.00),
(11, 109, 'Laptop', 201, 'Alice', '2023-01-25', 1, 1200.00, 1200.00),
(12, 110, 'Smartphone', 202, 'Bob', '2023-01-26', 2, 800.00, 1600.00),
(13, 111, 'Camera', 211, 'Kevin', '2023-01-27', 1, 700.00, 700.00),
(14, 112, 'Speaker', 212, 'Laura', '2023-01-28', 2, 250.00, 500.00),
(15, 113, 'Router', 213, 'Mallory', '2023-01-29', 1, 100.00, 100.00)
""")

In [20]:
mydb.commit()

In [43]:
cursor.execute("SELECT * FROM sidfirst.mysales")

In [44]:
results = cursor.fetchall()
columns = [column[0] for column in cursor.description]
print(tabulate(results,headers = columns,tablefmt = 'pretty'))

+---------+------------+--------------+-------------+---------------+------------+----------+---------+--------------+
| sale_id | product_id | product_name | customer_id | customer_name | sale_date  | quantity |  price  | total_amount |
+---------+------------+--------------+-------------+---------------+------------+----------+---------+--------------+
|    1    |    101     |    Laptop    |     201     |     Alice     | 2023-01-15 |    1     | 1200.00 |   1200.00    |
|    2    |    102     |  Smartphone  |     202     |      Bob      | 2023-01-16 |    2     | 800.00  |   1600.00    |
|    3    |    103     |    Tablet    |     203     |    Charlie    | 2023-01-17 |    1     | 500.00  |    500.00    |
|    4    |    101     |    Laptop    |     204     |     David     | 2023-01-18 |    1     | 1200.00 |   1200.00    |
|    5    |    104     |  Headphones  |     205     |      Eve      | 2023-01-19 |    3     | 150.00  |    450.00    |
|    6    |    105     |   Monitor    |     206     |     Frank     | 2023-01-20 |    2     | 300.00  |    600.00    |
|    7    |    102     |  Smartphone  |     207     |     Grace     | 2023-01-21 |    1     | 800.00  |    800.00    |
|    8    |    106     |   Keyboard   |     208     |     Heidi     | 2023-01-22 |    4     | 100.00  |    400.00    |
|    9    |    107     |    Mouse     |     209     |     Ivan      | 2023-01-23 |    2     |  50.00  |    100.00    |
|   10    |    108     |   Printer    |     210     |     Judy      | 2023-01-24 |    1     | 200.00  |    200.00    |
|   11    |    109     |    Laptop    |     201     |     Alice     | 2023-01-25 |    1     | 1200.00 |   1200.00    |
|   12    |    110     |  Smartphone  |     202     |      Bob      | 2023-01-26 |    2     | 800.00  |   1600.00    |
|   13    |    111     |    Camera    |     211     |     Kevin     | 2023-01-27 |    1     | 700.00  |    700.00    |
|   14    |    112     |   Speaker    |     212     |     Laura     | 2023-01-28 |    2     | 250.00  |    500.00    |
|   15    |    113     |    Router    |     213     |    Mallory    | 2023-01-29 |    1     | 100.00  |    100.00    |
+---------+------------+--------------+-------------+---------------+------------+----------+---------+--------------+

In [ ]:
# 1. Filtering rows based on single condition.. i.e Retrieve all the records with total_amount >= 1000

In [28]:
cursor.execute("SELECT sale_id,customer_name,total_amount FROM sidfirst.mysales WHERE total_amount >= 1000")

In [29]:
results = cursor.fetchall()
columns = [column[0] for column in cursor.description]
print(tabulate(results,headers = columns,tablefmt = 'pretty'))

+---------+---------------+--------------+
| sale_id | customer_name | total_amount |
+---------+---------------+--------------+
|    1    |     Alice     |   1200.00    |
|    2    |      Bob      |   1600.00    |
|    4    |     David     |   1200.00    |
|   11    |     Alice     |   1200.00    |
|   12    |      Bob      |   1600.00    |
+---------+---------------+--------------+

In [30]:
# ANOTHER QUE. SELECT ALL CUSTOMER WHO BOUGHT SMARTPHONE

In [32]:
cursor.execute("SELECT sale_id,product_name,customer_name FROM sidfirst.mysales WHERE product_name = 'smartphone'")

In [33]:
results = cursor.fetchall()
columns = [column[0] for column in cursor.description]
print(tabulate(results,headers = columns,tablefmt = 'pretty'))

+---------+--------------+---------------+
| sale_id | product_name | customer_name |
+---------+--------------+---------------+
|    2    |  Smartphone  |      Bob      |
|    7    |  Smartphone  |     Grace     |
|   12    |  Smartphone  |      Bob      |
+---------+--------------+---------------+

In [38]:
# 2.filtering rows using multiple conditions..
# 2.1 retrieve customers who bought more than one smartphone.. here condition 1 is smartphone another is >1
cursor.execute("SELECT sale_id,product_name,customer_name,quantity FROM sidfirst.mysales WHERE product_name = 'smartphone' AND quantity > 1")

In [39]:
results = cursor.fetchall()
columns = [column[0] for column in cursor.description]
print(tabulate(results,headers = columns,tablefmt = 'pretty'))

+---------+--------------+---------------+----------+
| sale_id | product_name | customer_name | quantity |
+---------+--------------+---------------+----------+
|    2    |  Smartphone  |      Bob      |    2     |
|   12    |  Smartphone  |      Bob      |    2     |
+---------+--------------+---------------+----------+

In [46]:
#3. using pattern matching with LIKE OPERATOR
# 3.1 retrieve all customers whose name starts with A

cursor.execute("SELECT * FROM sidfirst.mysales WHERE customer_name LIKE 'A%'")

In [47]:
results = cursor.fetchall()
columns = [column[0] for column in cursor.description]
print(tabulate(results,headers = columns,tablefmt = 'pretty'))

+---------+------------+--------------+-------------+---------------+------------+----------+---------+--------------+
| sale_id | product_id | product_name | customer_id | customer_name | sale_date  | quantity |  price  | total_amount |
+---------+------------+--------------+-------------+---------------+------------+----------+---------+--------------+
|    1    |    101     |    Laptop    |     201     |     Alice     | 2023-01-15 |    1     | 1200.00 |   1200.00    |
|   11    |    109     |    Laptop    |     201     |     Alice     | 2023-01-25 |    1     | 1200.00 |   1200.00    |
+---------+------------+--------------+-------------+---------------+------------+----------+---------+--------------+

In [53]:
# 3.2 retrieve all customers whose name starts with 'e'
cursor.execute("SELECT * FROM sidfirst.mysales WHERE customer_name LIKE '%e'")
print(tabulate(cursor.fetchall(), headers = [column[0] for column in cursor.description], tablefmt = 'pretty'))

+---------+------------+--------------+-------------+---------------+------------+----------+---------+--------------+
| sale_id | product_id | product_name | customer_id | customer_name | sale_date  | quantity |  price  | total_amount |
+---------+------------+--------------+-------------+---------------+------------+----------+---------+--------------+
|    1    |    101     |    Laptop    |     201     |     Alice     | 2023-01-15 |    1     | 1200.00 |   1200.00    |
|    3    |    103     |    Tablet    |     203     |    Charlie    | 2023-01-17 |    1     | 500.00  |    500.00    |
|    5    |    104     |  Headphones  |     205     |      Eve      | 2023-01-19 |    3     | 150.00  |    450.00    |
|    7    |    102     |  Smartphone  |     207     |     Grace     | 2023-01-21 |    1     | 800.00  |    800.00    |
|   11    |    109     |    Laptop    |     201     |     Alice     | 2023-01-25 |    1     | 1200.00 |   1200.00    |
+---------+------------+--------------+-------------+---------------+------------+----------+---------+--------------+

In [54]:
# 3.3 retrieve all the customers whose name contains letter 'i'
cursor.execute("SELECT * FROM sidfirst.mysales WHERE customer_name LIKE '%i%'")

In [55]:
print(tabulate(cursor.fetchall(), headers = [column[0] for column in cursor.description], tablefmt = 'pretty'))

+---------+------------+--------------+-------------+---------------+------------+----------+---------+--------------+
| sale_id | product_id | product_name | customer_id | customer_name | sale_date  | quantity |  price  | total_amount |
+---------+------------+--------------+-------------+---------------+------------+----------+---------+--------------+
|    1    |    101     |    Laptop    |     201     |     Alice     | 2023-01-15 |    1     | 1200.00 |   1200.00    |
|    3    |    103     |    Tablet    |     203     |    Charlie    | 2023-01-17 |    1     | 500.00  |    500.00    |
|    4    |    101     |    Laptop    |     204     |     David     | 2023-01-18 |    1     | 1200.00 |   1200.00    |
|    8    |    106     |   Keyboard   |     208     |     Heidi     | 2023-01-22 |    4     | 100.00  |    400.00    |
|    9    |    107     |    Mouse     |     209     |     Ivan      | 2023-01-23 |    2     |  50.00  |    100.00    |
|   11    |    109     |    Laptop    |     201     |     Alice     | 2023-01-25 |    1     | 1200.00 |   1200.00    |
|   13    |    111     |    Camera    |     211     |     Kevin     | 2023-01-27 |    1     | 700.00  |    700.00    |
+---------+------------+--------------+-------------+---------------+------------+----------+---------+--------------+

In [56]:
# 4. USING IN OPERATOR : retrieve the sales for specific products..retrieve the sales for laptop and smartphone
cursor.execute("SELECT * FROM sidfirst.mysales WHERE product_name IN ('laptop','smartphone')")

In [57]:
print(tabulate(cursor.fetchall(),headers = [column[0] for column in cursor.description],tablefmt = 'pretty'))

+---------+------------+--------------+-------------+---------------+------------+----------+---------+--------------+
| sale_id | product_id | product_name | customer_id | customer_name | sale_date  | quantity |  price  | total_amount |
+---------+------------+--------------+-------------+---------------+------------+----------+---------+--------------+
|    1    |    101     |    Laptop    |     201     |     Alice     | 2023-01-15 |    1     | 1200.00 |   1200.00    |
|    2    |    102     |  Smartphone  |     202     |      Bob      | 2023-01-16 |    2     | 800.00  |   1600.00    |
|    4    |    101     |    Laptop    |     204     |     David     | 2023-01-18 |    1     | 1200.00 |   1200.00    |
|    7    |    102     |  Smartphone  |     207     |     Grace     | 2023-01-21 |    1     | 800.00  |    800.00    |
|   11    |    109     |    Laptop    |     201     |     Alice     | 2023-01-25 |    1     | 1200.00 |   1200.00    |
|   12    |    110     |  Smartphone  |     202     |      Bob      | 2023-01-26 |    2     | 800.00  |   1600.00    |
+---------+------------+--------------+-------------+---------------+------------+----------+---------+--------------+

In [58]:
#4.1 with multiple columns
cursor.execute("SELECT product_name,quantity,total_amount FROM sidfirst.mysales WHERE product_name IN ('laptop','smartphone')")

In [59]:
print(tabulate(cursor.fetchall(),headers = [column[0] for column in cursor.description],tablefmt = 'pretty'))

+--------------+----------+--------------+
| product_name | quantity | total_amount |
+--------------+----------+--------------+
|    Laptop    |    1     |   1200.00    |
|  Smartphone  |    2     |   1600.00    |
|    Laptop    |    1     |   1200.00    |
|  Smartphone  |    1     |    800.00    |
|    Laptop    |    1     |   1200.00    |
|  Smartphone  |    2     |   1600.00    |
+--------------+----------+--------------+

In [6]:
# 5. BETWEEN OPERATOR : between the range : start value - end value
# 5.1 retrieve all columns using between operator of total amount 100 to 1000
cursor.execute("SELECT * FROM sidfirst.mysales WHERE total_amount BETWEEN 100 AND 1000 ")

In [7]:
print(tabulate(cursor.fetchall(),headers = [column[0] for column in cursor.description],tablefmt = 'pretty'))

+---------+------------+--------------+-------------+---------------+------------+----------+--------+--------------+
| sale_id | product_id | product_name | customer_id | customer_name | sale_date  | quantity | price  | total_amount |
+---------+------------+--------------+-------------+---------------+------------+----------+--------+--------------+
|    3    |    103     |    Tablet    |     203     |    Charlie    | 2023-01-17 |    1     | 500.00 |    500.00    |
|    5    |    104     |  Headphones  |     205     |      Eve      | 2023-01-19 |    3     | 150.00 |    450.00    |
|    6    |    105     |   Monitor    |     206     |     Frank     | 2023-01-20 |    2     | 300.00 |    600.00    |
|    7    |    102     |  Smartphone  |     207     |     Grace     | 2023-01-21 |    1     | 800.00 |    800.00    |
|    8    |    106     |   Keyboard   |     208     |     Heidi     | 2023-01-22 |    4     | 100.00 |    400.00    |
|    9    |    107     |    Mouse     |     209     |     Ivan      | 2023-01-23 |    2     | 50.00  |    100.00    |
|   10    |    108     |   Printer    |     210     |     Judy      | 2023-01-24 |    1     | 200.00 |    200.00    |
|   13    |    111     |    Camera    |     211     |     Kevin     | 2023-01-27 |    1     | 700.00 |    700.00    |
|   14    |    112     |   Speaker    |     212     |     Laura     | 2023-01-28 |    2     | 250.00 |    500.00    |
|   15    |    113     |    Router    |     213     |    Mallory    | 2023-01-29 |    1     | 100.00 |    100.00    |
+---------+------------+--------------+-------------+---------------+------------+----------+--------+--------------+

In [10]:
#6.combination of AND -- OR -- multiple conditions
# 6.1 retrieve all the sales of laptop made by 'Alice' or 'bob'
cursor.execute("SELECT * FROM sidfirst.mysales WHERE product_name = 'Laptop' AND (customer_name = 'Bob' OR customer_name = 'Alice' OR customer_name = 'David')")

In [11]:
print(tabulate(cursor.fetchall(),headers = [column[0] for column in cursor.description],tablefmt = 'pretty'))

+---------+------------+--------------+-------------+---------------+------------+----------+---------+--------------+
| sale_id | product_id | product_name | customer_id | customer_name | sale_date  | quantity |  price  | total_amount |
+---------+------------+--------------+-------------+---------------+------------+----------+---------+--------------+
|    1    |    101     |    Laptop    |     201     |     Alice     | 2023-01-15 |    1     | 1200.00 |   1200.00    |
|    4    |    101     |    Laptop    |     204     |     David     | 2023-01-18 |    1     | 1200.00 |   1200.00    |
|   11    |    109     |    Laptop    |     201     |     Alice     | 2023-01-25 |    1     | 1200.00 |   1200.00    |
+---------+------------+--------------+-------------+---------------+------------+----------+---------+--------------+

In [12]:
#6.2 combination of BETWEEN and NOT ..

cursor.execute("SELECT * FROM sidfirst.mysales WHERE price NOT BETWEEN 1000 AND 2000")

In [13]:
print(tabulate(cursor.fetchall(),headers = [column[0] for column in cursor.description],tablefmt = 'pretty'))

+---------+------------+--------------+-------------+---------------+------------+----------+--------+--------------+
| sale_id | product_id | product_name | customer_id | customer_name | sale_date  | quantity | price  | total_amount |
+---------+------------+--------------+-------------+---------------+------------+----------+--------+--------------+
|    2    |    102     |  Smartphone  |     202     |      Bob      | 2023-01-16 |    2     | 800.00 |   1600.00    |
|    3    |    103     |    Tablet    |     203     |    Charlie    | 2023-01-17 |    1     | 500.00 |    500.00    |
|    5    |    104     |  Headphones  |     205     |      Eve      | 2023-01-19 |    3     | 150.00 |    450.00    |
|    6    |    105     |   Monitor    |     206     |     Frank     | 2023-01-20 |    2     | 300.00 |    600.00    |
|    7    |    102     |  Smartphone  |     207     |     Grace     | 2023-01-21 |    1     | 800.00 |    800.00    |
|    8    |    106     |   Keyboard   |     208     |     Heidi     | 2023-01-22 |    4     | 100.00 |    400.00    |
|    9    |    107     |    Mouse     |     209     |     Ivan      | 2023-01-23 |    2     | 50.00  |    100.00    |
|   10    |    108     |   Printer    |     210     |     Judy      | 2023-01-24 |    1     | 200.00 |    200.00    |
|   12    |    110     |  Smartphone  |     202     |      Bob      | 2023-01-26 |    2     | 800.00 |   1600.00    |
|   13    |    111     |    Camera    |     211     |     Kevin     | 2023-01-27 |    1     | 700.00 |    700.00    |
|   14    |    112     |   Speaker    |     212     |     Laura     | 2023-01-28 |    2     | 250.00 |    500.00    |
|   15    |    113     |    Router    |     213     |    Mallory    | 2023-01-29 |    1     | 100.00 |    100.00    |
+---------+------------+--------------+-------------+---------------+------------+----------+--------+--------------+